---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.BorderTopLineStyle
source: html/1e89b157-e871-6dec-cc8c-bb76e97f1c90.htm
---
# Autodesk.Revit.DB.TableCellStyle.BorderTopLineStyle Property

The element id (GraphicsStyle element) for the top line of the cell border.

## Syntax (C#)
```csharp
public ElementId BorderTopLineStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null